c5/src/Documents/ChangesPermission/ChangesPermission.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ChangesPermission</name>
  <posting>Deny</posting>
  <attributes>
    <name>Class</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Expired</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/ChangesPermission/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	checkExpiration ( CheckedAttributes );

EndProcedure

Procedure checkExpiration ( CheckedAttributes )
	
	if ( Resolution = Enums.AllowDeny.Allow ) then
		CheckedAttributes.Add ( "Expired" );
	endif;

EndProcedure

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	if ( not checkAccess () ) then
		Cancel = true;
		return;
	endif;
	if ( DeletionMark ) then
		reset ();
	endif;

EndProcedure

Function checkAccess ()
	
	ok = Resolution.IsEmpty ()
	or IsInRole ( Metadata.Roles.RightsEdit )
	or Logins.Admin ()
	or Logins.Agent ();
	if ( ok ) then
		return true;
	endif;
	Output.ResolutionAlreadyIssued ();
	return false;

EndFunction

Procedure reset ()
	
	Organization = undefined;
	Document = undefined;
	Responsible = undefined;
	Resolution = undefined;

EndProcedure
